quest_system_14799775_name=^?^The Magical Dwarven Portal
quest_system_14799775_stage_0=^?^Retrieve the key to the portal from the Demons.
quest_system_14799775_stage_1=^?^Xeona told you that one of the architects has the sword of King Kerus, by which the demon lord Baal was once killed.
quest_system_14799775_stage_2=^?^Bring the broken key to Mehgard.
quest_system_14799775_stage_3=^?^With help of the key, close the Magic Portal, which is near the underground sea.
quest_system_14799775_stage_4=^?^Go to Taron and tell Torn Digor that the Magic Portal is closed.
quest_system_14799775_task=^?^Chief engineer Debat has charged you with putting an end to the war with the demons. In order to do this, it is necessary to close the Magic Portal, which leads to Demonis. You can do this only with the help of a special key.<br>The portal key is in the Demon's Land - probably in their capital: their ruler Baal may have it.<br>[reward]
